x-dl/esp8266-server-component/sever.c
/*
 * @Descripttion: 
 * @version: 
 * @Author: Jasper
 * @Date: 2021-09-19 15:26:28
 * @LastEditors: Jasper
 * @LastEditTime: 2021-09-25 08:08:52
 * @FilePath: \freertos\USER\sever.c
 */
#include "FreeRTOS.h"
#include "stm32f4xx.h"
#include "semphr.h"
#include "stdio.h"
#include "task.h"
#include "timers.h"
#include "string.h"
#include "stdlib.h"
/* 添加该服务器组件所需要的硬件及其驱动，与具体的硬件平台有关 */
static void BSP_UART_Init(void);
static void BSP_TIM6_Init(void);
static void BSP_DMA_Init(DMA_Stream_TypeDef *DMA_Streamx, u32 chx, u32 par, u32 mar, u16 ndtr);
static void BSP_SDMA(DMA_Stream_TypeDef *DMA_Streamx, u32 chx, u32 par, u32 mar, u16 ndtr);
/* 服务器组件中与硬件平台无关的函数 */
static void myprintf3(char *str);
static void myprintf3_INT(char *str); //但是需要注意，字符串以/0结尾
static void myprintf3_DMA(char *str);
void USART3_IRQ_Enable(void);
void USART3_IRQ_Disable(void);
static void vThreadx_task(void *pvParameters);
static void esp8266_task(void *pvParameters);
static unsigned char reqid_get(char *recv); //获取请求id号 请求id来自于客户端
/* 服务器组件中的信号量 */
static SemaphoreHandle_t xSemaphore = NULL;
static xSemaphoreHandle private_SEVER_thread_mutex = 0;
static xSemaphoreHandle DMA_Transmit_semaphore = pdFALSE;
/* 服务器用到的字符串 */
static const char esp8266_cmd[][40];
static const char esp82666_hello[];
static const char esp82666_response[];
static const char Thread_Name[][10];
/* 线程控制块 */
typedef struct idtask
{
    TaskHandle_t IDTask_Handler;
    unsigned char thread_status;
    unsigned char client_status;
    unsigned char thread_ID;
    char task[10];
} IDtask;
/* 相关宏定义 */
#define TICKS_TO_WAIT 10
#define USART_REC_LEN 200     //定义最大接收字节数 200
#define SERVICE_NAME_LENGTH 3 //服务器提供服务的名称的数目是3
//任务优先级
#define THREADX_TASK_PRIO 4
//任务堆栈大小
#define THREADX_STK_SIZE 128
//任务优先级
#define esp8266_TASK_PRIO 6
//任务堆栈大小
#define esp8266_STK_SIZE 128
//任务句柄
TaskHandle_t esp8266_Task_Handler;
/* 服务器组件中相关全局变量 */
static u8 USART_RX_BUF[USART_REC_LEN] = {0}; //接收缓冲,最大USART_REC_LEN个字节.
static u16 USART_RX_CNT = 0;                 //接收状态标记
static u16 USART_RX_PRECNT = 0;              //接收状态标记
static u8 flag = pdFALSE;                    //服务器的状态标志，默认服务器是没有准备好的
static u8 isr_flag = pdTRUE;
static unsigned char *pc_SEVER_myprintf1 = NULL;
void Sever_task(void *pvParameters)
{
    unsigned char *ucpsend_item = USART_RX_BUF;
    char send[20] = {"hello world!!!\r\n"};
    unsigned char request_id = NULL;
    IDtask IDArray[5] = {0};       /* 记录五个线程的状态 */
    IDtask *Current_IDtask = NULL; /* 指向当前任务 */
    char(*Current_Thread_Name)[10] = NULL;
    /* 初始化硬件 */
    BSP_UART_Init();
    BSP_TIM6_Init();
    BSP_DMA_Init(DMA1_Stream3, DMA_Channel_4, (u32)&USART3->DR, (u32)send, (u16)strlen(send)); //配置简化版的DMA
    USART_DMACmd(USART3, USART_DMAReq_Tx, ENABLE);                                             //使能串口1的DMA发送
    /*创建信号量 */
    xSemaphore = xSemaphoreCreateBinary();
    DMA_Transmit_semaphore = xSemaphoreCreateBinary();
    private_SEVER_thread_mutex = xSemaphoreCreateMutex();
    if (private_SEVER_thread_mutex == NULL)
    {
        printf("private_SEVER_thread_mutex fail\r\n");
    }
    if (DMA_Transmit_semaphore == NULL)
    {
        printf("DMA_Transmit_semaphore fail\r\n");
    }
    if (xSemaphore == NULL)
    {
        /* There was insufficient FreeRTOS heap available for the semaphore to
        be created successfully. */
        printf("sever xsemaphore fail\r\n");
    }
    else /* 信号量全部创建成功则开始尝试连接sever */
    {
        printf("try to acquire sever\r\n");
        myprintf3((char *)(((char(*)[40])(*esp8266_cmd)) + 6)); //查看当前esp8266是否已经连接上wifi
        //printf((const char *)(((char(*)[40])(*esp8266_cmd)) + 6)); //查看当前esp8266是否已经连接上wifi
        if (xSemaphoreTake(xSemaphore, portMAX_DELAY / portTICK_PERIOD_MS) == pdTRUE)
        {
            isr_flag = pdTRUE;
            //printf((const char *)USART_RX_BUF);                         //确保串口可以获取数据
            if (strstr((const char *)USART_RX_BUF, "No AP") != pdFALSE) //如果检索到，就意味这个时候还没有连接上热点
            {
                taskENTER_CRITICAL();                               //进入临界区
                xTaskCreate((TaskFunction_t)esp8266_task,           //任务函数
                            (const char *)"esp8266",                //任务名称
                            (uint16_t)esp8266_STK_SIZE,             //任务堆栈大小
                            (void *)NULL,                           //传递给任务函数的参数
                            (UBaseType_t)esp8266_TASK_PRIO,         //任务优先级
                            (TaskHandle_t *)&esp8266_Task_Handler); //任务句柄
                taskEXIT_CRITICAL();                                //退出临界区
            }
            else
            {
                myprintf3((char *)(((char(*)[40])(*esp8266_cmd)) + 3)); //打印获取wifi的命令
                if (xSemaphoreTake(xSemaphore, portMAX_DELAY / portTICK_PERIOD_MS) == pdTRUE)
                {
                    ucpsend_item = (USART_RX_BUF + 24); //获取ip地址的首地址
                    *(ucpsend_item + 15) = '\0';        //截取字符串
                    sprintf((char *)USART_RX_BUF, "ipaddress:%s\r\n", (const char *)ucpsend_item);
                    *(USART_RX_BUF + 28) = '\0'; //截取字符串
                    printf((const char *)USART_RX_BUF);
                    printf("esp8266 successful init norst\r\n");
                    isr_flag = pdTRUE; //在开启服务器之前，先要确保串口数据能够正常收发
                    flag = pdTRUE;     //锁钥定理,这个时候可以开启服务器,不需要开启任务
                }
                else
                {
                    printf("sever open failed");
                }
            }
            ucpsend_item = USART_RX_BUF; //在接受下一帧数据的时候可以指向数组首地址
        }
        else
        {
            printf("wait time error!!!\r\n");
        }
        /* The semaphore can now be used. Its handle is stored in the
        xSemahore variable.  Calling xSemaphoreTake() on the semaphore here
        will fail until the semaphore has first been given. */

        while (1)
        {
            /* A context switch will occur before the function returns if the priority being set is higher than the currently executing task.
                if we do this ,its actually do switch*/
            vTaskPrioritySet(NULL, tskIDLE_PRIORITY + 2); //just make sever task a bit higher than idle task thraed task must lower than sever
            if (flag == pdTRUE)                           //如果为真,则开启服务器
            {
                printf("sever have started!!!\r\n");
                while (1) //开启服务器后服务器的行为
                {
                    if (xSemaphoreTake(xSemaphore, 100 / portTICK_PERIOD_MS) == pdTRUE) //接受来自串口3的数据
                    {

