x-dl/esp8266-server-component/sever.c
                        /* It is time to start sever. */
                        ucpsend_item = USART_RX_BUF;
                        //printf(":::%s", ucpsend_item);
                        request_id = reqid_get((char *)ucpsend_item); /* Attention:服务器开启后接受到的第一帧数据一定是来自客户端的请求服务 */
                        //printf("%d\r\n", request_id);
                        switch (request_id)
                        {
                        case 0: /* 这个语句没有用 */
                            /* printf("can not find the command \r\n"); */
                            break;
                        case 1:
                        {
                            isr_flag = pdTRUE; //为了能让串口接收到数据 ，这里必须确保变量为真
                            ucpsend_item = USART_RX_BUF;
                            Current_IDtask = IDArray;
                            Current_IDtask += (*ucpsend_item - '0'); /* 记录此时需要服务的客户端 */
                            Current_IDtask->client_status = pdTRUE;  /* 客户端进行注册 */
                            sprintf((char *)ucpsend_item, "AT+CIPSEND=%c,%d\r\n", *ucpsend_item, strlen((const char *)esp82666_hello));
                            xSemaphoreTake(private_SEVER_thread_mutex, 200 / portTICK_PERIOD_MS); /* 获取互斥量 */
                            myprintf3_DMA((char *)ucpsend_item);
                            if (xSemaphoreTake(DMA_Transmit_semaphore, 100 / portTICK_PERIOD_MS) == pdTRUE)
                            {
                                if (xSemaphoreTake(xSemaphore, 100 / portTICK_PERIOD_MS) == pdTRUE) //接受来自串口3的数据
                                {
                                    if (strstr((const char *)ucpsend_item, (const char *)"OK") != NULL) //可以发送数据了
                                    {
                                        USART3_IRQ_Disable();                  //发送数据之前先把串口3接受中断失能
                                        myprintf3_DMA((char *)esp82666_hello); //向客户端发送服务器可提供的服务

                                        if (xSemaphoreTake(DMA_Transmit_semaphore, 100 / portTICK_PERIOD_MS) == pdTRUE) //正常情况下10ms足以
                                        {
                                            vTaskDelay(200 / portTICK_PERIOD_MS);
                                            USART3_IRQ_Enable(); //先延时100ms,然后发送数据之前先把串口3接受中断使能
                                        }
                                        else
                                        {
                                            printf("sever DMA_Transmit_semaphore error!!!\r\n");
                                        }
                                    }
                                    else
                                    {
                                        printf("accept OK error\r\n");
                                    }
                                    isr_flag = pdTRUE; //串口可以再次获取数据
                                }
                            }
                            else
                            {
                                printf("accept client first error\r\n");
                            }
                            xSemaphoreGive(private_SEVER_thread_mutex); /* 归还互斥量 */
                        }
                        break;
                        case 2:
                            /* its time to shutdown the thread */
                            taskENTER_CRITICAL(); //进入临界区
                            ucpsend_item = USART_RX_BUF;
                            Current_IDtask = IDArray;
                            Current_IDtask += (*ucpsend_item - '0'); /* 记录此时需要服务的客户端 */
                            vTaskDelete(Current_IDtask->IDTask_Handler);
                            Current_IDtask->IDTask_Handler = NULL;
                            Current_IDtask->client_status = pdFALSE; /* 客户端进行注册 */
                            Current_IDtask->thread_status = pdFALSE;
                            Current_IDtask->thread_ID = NULL;
                            memset(Current_IDtask->task, 0, sizeof(Current_IDtask->task));
                            taskEXIT_CRITICAL();
                            break;
                        case 3:
                            /* its time to shutdown the thread */
                            taskENTER_CRITICAL(); //进入临界区
                            ucpsend_item = USART_RX_BUF;
                            Current_IDtask = IDArray;
                            Current_IDtask += (*ucpsend_item - '0'); /* 记录此时需要服务的客户端 */
                            vTaskDelete(Current_IDtask->IDTask_Handler);
                            Current_IDtask->IDTask_Handler = NULL;
                            Current_IDtask->client_status = pdFALSE; /* 客户端进行注册 */
                            Current_IDtask->thread_status = pdFALSE;
                            Current_IDtask->thread_ID = NULL;
                            memset(Current_IDtask->task, 0, sizeof(Current_IDtask->task));
                            taskEXIT_CRITICAL();
                            break;
                            /* 一下是服务器提供的服务，默认是6个服务，可以继续增加 */
                        case 4:
                        case 5:
                        case 6:
                        case 7:
                        case 8:
                        case 9:
                        {
                            printf((const char *)ucpsend_item);
                            ucpsend_item = USART_RX_BUF;
                            ucpsend_item += 7; /* 获取客户端的ID号 */
                            Current_IDtask = IDArray;
                            Current_IDtask += (*ucpsend_item - '0');     /* 记录此时需要服务的客户端 */
                            if (Current_IDtask->client_status == pdTRUE) /* 客户端注册成功，为客户端分配线程，并且初始化线程*/
                            {
                                if (Current_IDtask->thread_status == pdTRUE) /* 意味着服务器已经为客户端分配了线程 */
                                {
                                    taskENTER_CRITICAL(); //进入临界区
                                    ucpsend_item = (unsigned char *)strstr((char *)ucpsend_item, ".");
                                    ucpsend_item += 1; /* 此时指向客户端的请求 */
                                    memcpy(Current_IDtask->task, ucpsend_item, SERVICE_NAME_LENGTH);
                                    taskEXIT_CRITICAL(); //退出临界区
                                }
                                else
                                {

                                    Current_Thread_Name = (char(*)[10])Thread_Name;
                                    Current_Thread_Name += (*ucpsend_item - '0');
                                    xSemaphoreTake(private_SEVER_thread_mutex, 200 / portTICK_PERIOD_MS);       /* 获取互斥量 防止DMA中断*/
                                    taskENTER_CRITICAL();                                                       //进入临界区
                                    if (xTaskCreate((TaskFunction_t)vThreadx_task,                              //任务函数
                                                    (const char *)Current_Thread_Name,                          //任务名称
                                                    (uint16_t)THREADX_STK_SIZE,                                 //任务堆栈大小
                                                    (void *)Current_IDtask,                                     //传递给任务函数的参数
                                                    (UBaseType_t)tskIDLE_PRIORITY + 1,                          //任务优先级
                                                    (TaskHandle_t *)&Current_IDtask->IDTask_Handler) == pdPASS) //任务句柄
                                    {

                                        Current_IDtask->thread_status = pdTRUE;
                                        Current_IDtask->thread_ID = (*ucpsend_item - '0');
                                        ucpsend_item = (unsigned char *)strstr((char *)ucpsend_item, ".");
                                        ucpsend_item += 1; /* 此时指向客户端的请求 */
                                        memcpy(Current_IDtask->task, ucpsend_item, SERVICE_NAME_LENGTH);
                                        taskEXIT_CRITICAL(); //退出临界区
                                        /* 然后告诉客户端，你的数据就要来了 */
                                        ucpsend_item = USART_RX_BUF;
                                        ucpsend_item += 7; /* 获取客户端的ID号 */
                                        sprintf((char *)USART_RX_BUF, "AT+CIPSEND=%c,%d\r\n", *ucpsend_item, strlen((const char *)esp82666_response));
                                        isr_flag = pdTRUE; //串口可以再次获取数据
                                        ucpsend_item = USART_RX_BUF;
                                        myprintf3_DMA((char *)ucpsend_item);
                                        if (xSemaphoreTake(DMA_Transmit_semaphore, 100 / portTICK_PERIOD_MS) == pdTRUE)
                                        {
                                            if (xSemaphoreTake(xSemaphore, 100 / portTICK_PERIOD_MS) == pdTRUE) //接受来自串口3的数据
                                            {
                                                if (strstr((const char *)ucpsend_item, (const char *)"OK") != NULL) //可以发送数据了
                                                {
                                                    USART3_IRQ_Disable();                     //发送数据之前先把串口3接受中断失能
                                                    myprintf3_DMA((char *)esp82666_response); //向客户端发送服务器可提供的服务

                                                    if (xSemaphoreTake(DMA_Transmit_semaphore, 100 / portTICK_PERIOD_MS) == pdTRUE) //正常情况下10ms足以
                                                    {
                                                        vTaskDelay(200 / portTICK_PERIOD_MS);
                                                        USART3_IRQ_Enable(); //先延时100ms,然后发送数据之前先把串口3接受中断使能
                                                    }
                                                    else
                                                    {
                                                        printf("sever DMA_Transmit_semaphore error!!!\r\n");
                                                    }
                                                }
                                                else
                                                {
                                                    printf("accept OK error\r\n");
                                                }
                                                isr_flag = pdTRUE; //串口可以再次获取数据
                                            }
                                            else
                                            {
                                                printf("UART locked\r\n");
                                            }
                                        }
                                        else
                                        {
                                            printf("DMA locked\r\n");
                                        }
                                    } /* 至此，线程初始化完成 */
                                    else
                                    {
                                        printf("thread create failure!!!\r\n");
                                    }

