x-dl/esp8266-server-component/sever.c
    DMA_ITConfig(DMA1_Stream3, DMA_IT_TC, ENABLE);
}
static void BSP_SDMA(DMA_Stream_TypeDef *DMA_Streamx, u32 chx, u32 par, u32 mar, u16 ndtr)
{

    DMA_InitTypeDef DMA_InitStructure;
    /* 配置 DMA Stream */
    DMA_InitStructure.DMA_Channel = chx;                                    //通道选择
    DMA_InitStructure.DMA_PeripheralBaseAddr = par;                         //DMA外设地址
    DMA_InitStructure.DMA_Memory0BaseAddr = mar;                            //DMA 存储器0地址
    DMA_InitStructure.DMA_DIR = DMA_DIR_MemoryToPeripheral;                 //存储器到外设模式
    DMA_InitStructure.DMA_BufferSize = ndtr;                                //数据传输量
    DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;        //外设非增量模式
    DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;                 //存储器增量模式
    DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte; //外设数据长度:8位
    DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;         //存储器数据长度:8位
    DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;                           // 使用普通模式
    DMA_InitStructure.DMA_Priority = DMA_Priority_Medium;                   //中等优先级
    DMA_InitStructure.DMA_FIFOMode = DMA_FIFOMode_Disable;
    DMA_InitStructure.DMA_FIFOThreshold = DMA_FIFOThreshold_Full;
    DMA_InitStructure.DMA_MemoryBurst = DMA_MemoryBurst_Single;         //存储器突发单次传输
    DMA_InitStructure.DMA_PeripheralBurst = DMA_PeripheralBurst_Single; //外设突发单次传输
    DMA_Init(DMA_Streamx, &DMA_InitStructure);                          //初始化DMA Stream
}
void USART3_IRQHandler(void)
{
    SEGGER_SYSVIEW_RecordEnterISR();
    if (USART_GetITStatus(USART3, USART_IT_RXNE) != RESET)
    {
        USART_ClearITPendingBit(USART3, USART_IT_RXNE);
        /* Read one byte from the receive data register */
        USART_RX_BUF[USART_RX_CNT++] = USART_ReceiveData(USART3);
        if (USART_RX_CNT == USART_REC_LEN - 1) //留一位给'\0'
        {
            USART_RX_CNT = 0;
            USART_RX_PRECNT = 0;
        }
    }
    if (USART_GetITStatus(USART3, USART_IT_TXE) != RESET) //发送中断
    {
        if (*pc_SEVER_myprintf1 == pdFALSE)
        {
            USART_ITConfig(USART3, USART_IT_TXE, DISABLE); //数据发送完成，串口发送中断失能
        }
        else
        {
            USART3->DR = (u8)*pc_SEVER_myprintf1++; //数据还没有发送完成
        }
    }
    SEGGER_SYSVIEW_RecordExitISR();
}
void TIM6_DAC_IRQHandler(void) //曾经的错误：void TIM6_DAC_IRQn (void),TIM6_IRQHandler
{
    SEGGER_SYSVIEW_RecordEnterISR();
    static int count = 0;
    if (TIM_GetITStatus(TIM6, TIM_IT_Update) == SET) //溢出中断
    {
        count++;
        if (count == 50) //大周期
        {
            count = 0;
            if (isr_flag == pdTRUE)
            {
                if (USART_RX_CNT != 0)
                {
                    if (USART_RX_CNT != USART_RX_PRECNT)
                    {
                        USART_RX_PRECNT = USART_RX_CNT;
                        count = 10; //小周期
                    }
                    else
                    {
                        USART_RX_BUF[USART_RX_CNT] = '\0';
                        USART_RX_PRECNT = 0;
                        USART_RX_CNT = 0;
                        isr_flag = pdFALSE;
                        xSemaphoreGiveFromISR(xSemaphore, NULL);
                    }
                }
            }
        }
    }
    TIM_ClearITPendingBit(TIM6, TIM_IT_Update); //清除中断标志位
    SEGGER_SYSVIEW_RecordExitISR();
}
void DMA1_Stream3_IRQHandler(void) // 串口3 DMA发送中断处理函数
{
    SEGGER_SYSVIEW_RecordEnterISR();
    if (DMA_GetITStatus(DMA1_Stream3, DMA_IT_TCIF3) != RESET)
    {
        DMA_ClearFlag(DMA1_Stream3, DMA_FLAG_TCIF3);
        DMA_Cmd(DMA1_Stream3, DISABLE);                      // 关闭DMA
        DMA_SetCurrDataCounter(DMA1_Stream3, 0);             //传输数据量为0
        xSemaphoreGiveFromISR(DMA_Transmit_semaphore, NULL); //注意,此时DMA的优先级大于任务优先级，不能使用freertos ISR API
    }
    SEGGER_SYSVIEW_RecordExitISR();
}
static void myprintf3(char *str)
{
    USART_ClearFlag(USART3, USART_FLAG_TC); //防止出现stm32第一个字符丢失的现象
    while (*str)
    {
        USART3->DR = (u8)*str;
        while ((USART3->SR & 0X40) == 0)
            ; //循环发送,直到发送完毕
        str++;
    }
}
static void myprintf3_DMA(char *str) //但是需要注意，字符串以/0结尾
{
    USART_ClearFlag(USART3, USART_FLAG_TC); //防止出现stm32第一个字符丢失的现象
    DMA_Cmd(DMA1_Stream3, DISABLE);         //关闭DMA传输
    while (DMA_GetCmdStatus(DMA1_Stream3) != DISABLE)
    {
    }                                                                               //确保DMA可以被设置
    BSP_SDMA(DMA1_Stream3, DMA_Channel_4, (u32)&USART3->DR, (u32)str, strlen(str)); //配置简化版的DMA
    DMA_Cmd(DMA1_Stream3, ENABLE);                                                  //开启DMA传输
}
static void myprintf3_INT(char *str) //但是需要注意，字符串以/0结尾
{
    USART_ClearFlag(USART3, USART_FLAG_TC);       //防止出现stm32第一个字符丢失的现象
    pc_SEVER_myprintf1 = (u8 *)str;               //更新printf所指向的字符串
    USART_ITConfig(USART3, USART_IT_TXE, ENABLE); //开启发送中断
}
void USART3_IRQ_Enable(void)
{
    NVIC_InitTypeDef NVIC_InitStructure;
    NVIC_InitStructure.NVIC_IRQChannel = USART3_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 5;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);
}
void USART3_IRQ_Disable(void)
{
    NVIC_InitTypeDef NVIC_InitStructure;
    NVIC_InitStructure.NVIC_IRQChannel = USART3_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 5;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelCmd = DISABLE;
    NVIC_Init(&NVIC_InitStructure);
}
static unsigned char reqid_get(char *recv)
{
    char(*ptr)[40] = (((char(*)[40])(*esp8266_cmd)) + 7); //指向待识别的命令
    char count_id = 1;                                    /* 0代表着没有找到命令 */
    while (*ptr)
    {
        if (strstr(recv, (char *)ptr) != NULL)
        {
            return count_id;
        }
        else
        {
            count_id++;
            ptr++;
        }
    }
    /* 如果运行到这一步，那就意味着服务器无法识别来自客户端的命令，将告知客户端服务器无法识别 */
    return NULL;
}
/**
 * @Function Name: esp8266_task
 * @Description: 用于初始化服务器
 * @Param: pvParameters
 * @Return: 无
 * @param {void} *pvParameters
 */
static void esp8266_task(void *pvParameters)
{
    unsigned char *ucpsend_item = USART_RX_BUF;
    char(*ptr)[40] = (char(*)[40]) * (esp8266_cmd + 0);
    char count = 6;
    while (count--)
    {

        myprintf3((char *)ptr++);
        if (xSemaphoreTake(xSemaphore, portMAX_DELAY / portTICK_PERIOD_MS) == pdTRUE)
        {
            if (count == 4) //针对at+rst的操作
            {
                USART3_IRQ_Disable();
                vTaskDelay(100 / portTICK_PERIOD_MS);
                USART3_IRQ_Enable();
                vTaskDelay(100 / portTICK_PERIOD_MS);
                goto end;
            }
            if (count == 3) //针对连接热点的操作
            {
                isr_flag = pdTRUE; //此时已经接收到来自esp8266的第一帧数据，先确保串口可以再次获取数据以至于信号量的获取可以正常
                                   //进行
                while (1)
                {
                    if (xSemaphoreTake(xSemaphore, portMAX_DELAY / portTICK_PERIOD_MS) == pdTRUE)
                    {
                        if (strstr((const char *)ucpsend_item, "OK") != pdFALSE) //检查得到的数据中是否有OK，不同的wifi模块有不同的情况
                        {
                            //printf(":::%s\r\n", ucpsend_item);
                            goto end;
                        }
                        isr_flag = pdTRUE; //确保串口可以再次获取数据
                    }
                }
            }
            if (count == 2) //针对获取wifi热点的操作
            {
                ucpsend_item = (USART_RX_BUF + 24); //获取ip地址的首地址
                *(ucpsend_item + 15) = '\0';        //截取字符串
                sprintf((char *)USART_RX_BUF, "ipaddress:%s\r\n", (const char *)ucpsend_item);
                *(USART_RX_BUF + 28) = '\0'; //截取字符串
                printf((const char *)USART_RX_BUF);
                ucpsend_item = USART_RX_BUF; //在接受下一帧数据的时候可以指向数组首地址
                goto end;
            }
            /* It is time to execute. */

