x-dl/esp8266-server-component/sever.c
            /* We have finished our task.  Return to the top of the loop where
            we will block on the semaphore until it is time to execute
            again.  Note when using the semaphore for synchronisation with an
            ISR in this manner there is no need to 'give' the semaphore
            back. */

            //            while (*ucpsend_item)
            //            {
            //                if (xQueueSend(public_queue, ucpsend_item, 20 / portTICK_PERIOD_MS) == pdTRUE)
            //                {
            //                    ucpsend_item++;
            //                }
            //                else
            //                 {
            //                    printf("sever queue send fail\r\n");
            //                }
            //            }
            //printf(":%s\r\n", ucpsend_item);
        end:
            isr_flag = pdTRUE; //串口可以再次获取数据
        }
    }
    printf("esp8266 successful init rst\r\n");
    flag = pdTRUE; //锁钥定理,这个时候可以开启服务器，并把临时创建的esp8266任务给删除
    vTaskDelete(NULL);
}
/**
 * @Function Name: vThreadx_task
 * @Description: 需要实现和C++特性相类型的函数重载
 * @Param: 线程相关参数
 * @Return: 无
 * @param {void} *pvParameters
 */
static void vThreadx_task(void *pvParameters)
{
    IDtask *thread = (IDtask *)pvParameters;
    while (1)
    {
        taskENTER_CRITICAL(); //进入临界区
        printf("i am %d\r\n", thread->thread_ID);
        taskEXIT_CRITICAL();
        vTaskDelay(1000 / portTICK_PERIOD_MS);
    }
}
static const char esp82666_hello[] =
    {"      |--------------------------------------------------------------|\r\n\
      |Hello  Client                                                 |\r\n\
      |Attention:Just send the severce number that you what to me    |\r\n\
      |Sever have supported the severce which is display below:      |\r\n\
      |1.aaa     2.bbb     3.ccc     4.ddd     5.eee     6.fff       |\r\n\
      |When you have send the order,What you need to do is to wait   |\r\n\
      |The data type is key-value class. and the frame has head cheek|\r\n\
      |Every data frame has '0XA5 0X5A' head cheak                   |\r\n\
      |The Server is still to be improved,  Hope your join           |\r\n\
      |--------------------------------------------------------------|\r\n\
      |   This Light Server Framework is build by Jasper from JXUST  |\r\n\
      |--------------------------------------------------------------|\r\n"};
static const char esp82666_response[] =
    {"      |--------------------------------------------------------------|\r\n\
      |                     Your Data is Comming                     |\r\n\
      |                     Just wait for a moment                   |\r\n\
      |--------------------------------------------------------------|\r\n"};
static const char Thread_Name[][10] = {
    "Thread #0",
    "Thread #1",
    "Thread #2",
    "Thread #3",
    "Thread #4",
};
/* 
    这里的esp8266的命令顺序是按照服务器配置顺序的，根据不同的服务器初始化进行配置即可
    串口发送出去的第一个字符是作废的！！！！（问题已解决）
 */
static const char esp8266_cmd[][40] = {
    /* 服务器初始化流程 */
    "AT+CWMODE=1\r\n",
    "AT+RST\r\n",
    "AT+CWJAP=\"s008\",\"dianxin132\"\r\n",
    "AT+CIFSR\r\n",
    "AT+CIPMUX=1\r\n",
    "AT+CIPSERVER=1,1001\r\n",
    /* 查询热点 */
    "AT+CWJAP?\r\n",
    /* 客户端请求和退出cmd */
    ",CONNECT\r\n", /* 客户端第一个命令 */
    ",CONNECT FAIL\r\n",
    ",CLOSED\r\n",
    /* 
        服务器能够提供的服务
     */
    "1.aaa",
    "2.bbb",
    "3.ccc",
    "4.ddd",
    "5.eee",
    "6.fff",
    "\0\0\0\0\0\0\0\0\0\0", /* 结束循环检测命令 */
};